app/views/tags/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "posts_tags" ON "posts"."id" = "posts_tags"."post_id" WHERE "posts_tags"."tag_id" = ?  [["tag_id", 11]]
---
<ul>
  <% @tag.posts.each do |p| %>