app/views/posts/new.html.erb

SELECT "tags".* FROM "tags"
---

  <%= p.collection_check_boxes(:tag_ids, Tag.all, :id, :name) %><br>