app/views/posts/show.html.erb

    <ul>
      <% @post.tags.each do | tag | %>
---
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 1]]

    <ul>
      <% @post.likes.each do |like| %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]