app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 51], ["post_id", 435], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 421]]
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 2], ["user_id", 6], ["created_at", "2019-03-26 20:30:39.180635"], ["updated_at", "2019-03-26 20:30:39.180635"]]
---
  def create_like
    @post = Post.find(params[:id])
    checker = Like.find_by(user_id: session["user_id"], post_id: params[:id])
    if !checker.nil?
      checker.destroy
      redirect_to post_path(@post)
    else
      @post.likes << Like.create(:user_id => session["user_id"])

SELECT "posts".* FROM "posts" WHERE (title LIKE 'lady')
SELECT "tags".* FROM "tags" WHERE (name LIKE 'weird')
SELECT "posts".* FROM "posts"
---
  def index
    if params[:post_search]
      @posts = Post.where('title LIKE ?', "#{params[:post_search]}")
      tags = Tag.where('name LIKE ?', "#{params[:post_search]}")
      tags.each do | tag |
        @posts += tag.posts
      end
    else
      @posts = Post.all

INSERT INTO "posts" ("img_url", "title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    # byebug
    # p = post_params
    # p[:tag_ids].reject!(&:blank?)
    @post = Post.new(post_params)
    # @post = Post.create!(post_params)
    # byebug
    @post.user_id = session["user_id"]
    @post.save!

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]
---
  def destroy
    @post = Post.find(params[:id])
    if !(@post.user == current_user_object)
      redirect_to post_path
    end
    @post.destroy