app/controllers/sessions_controller.rb

  def create
    username = params[:username]
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Merp"], ["LIMIT", 1]]